# encoding=utf-8
import matplotlib.pyplot as plt
from pylab import *                                 #支持中文
mpl.rcParams['font.sans-serif'] = ['SimHei']

names = ['0.5','0.6','0.7','0.8','0.9','1.0']#横坐标
x = range(len(names))
# JSD
#y = [0.008010576,0.004968287,0.004303913,0.006041267,0.006150513,0.008580232]
#y1=[0.005183132,0.00611537,0.006500338,0.00526916,0.00549552,0.006976469]
#y2=[0.005412676,0.00449054,0.004649172,0.005069015,0.004178211,0.005510701]
#y3=[0.004587355,0.005748208,0.006297116,0.006792972,0.006900773,0.006599003]
#y4=[0.0081192,0.008376743,0.008382899,0.009181676,0.010038209,0.009179388]
#y5=[0.008010576,0.00670865,0.006507468,0.007297756,0.008502907,0.008733585]

# JSDa
#y = [0.357574981,0.412650301,0.300760317,0.447802235,0.496806247,0.674055623]
#y1 = [0.519842397,0.600465781,0.56724697,0.614554537,0.48738783,0.660234146]
#y2 = [0.365713504,0.374328623,0.479564723,0.498741369,0.326173767,0.506224335]
#y3 = [0.397760613,0.440515623,0.346459148,0.395438915,0.551435946,0.525973491]
#y4 = [0.576545573,0.592681443,0.4633774,0.517131513,0.523801752,0.5150617]
#y5 = [0.446460103,0.339029477,0.489899135,0.575556704,0.622527077,0.649444666]

# PE JSD
#y = [0.06,0.10,0.94,0.61,0.92,0.96]
#y1 = [0.16,0.15,0.27,0.21,0.90,0.95]
#y2 = [0.23,0.36,0.35,0.41,0.52,0.57]
#y3 = [0.22,0.28,0.19,0.21,0.24,0.21]
#y4 = [0.03,0.07,0.04,0.06,0.15,0.06]
#y5 = [0.28,0.24,0.28,0.36,0.26,0.33]

# PE JSDa
y = [0.84,0.80,0.90,0.97,0.96,0.94]
y1 = [0.88,0.90,0.94,0.96,0.98,1.00]
y2 = [0.89,0.90,0.90,0.92,0.93,0.92]
y3 = [0.88,0.88,0.87,0.87,0.88,0.87]
y4 = [0.82,0.87,0.87,0.90,0.90,0.85]
y5 = [0.78,0.78,0.83,0.89,0.81,0.84]


#plt.plot(x, y, 'ro-')
#plt.plot(x, y1, 'bo-')
#pl.xlim(-1, 11)  # 限定横轴的范围
#pl.ylim(-1, 110)  # 限定纵轴的范围

plt.figure(figsize=(6,3))
plt.plot(x, y,  marker='o',mfc='w', ms=6,label=u'd=-0.5')
plt.plot(x, y1, marker='*',mfc='w', ms=6,label=u'd=-0.3')
plt.plot(x, y2, marker='D',mfc='w', ms=6,label=u'd=-0.1')
plt.plot(x, y3, marker='+',mfc='w', ms=6,label=u'd=0.1')
plt.plot(x, y4, marker='s',mfc='w', ms=6,label=u'd=0.3')
plt.plot(x, y5, marker='x',mfc='w', ms=6,label=u'd=0.5')
#plt.legend(loc='center left')  # 让图例生效
plt.legend(loc='center left', bbox_to_anchor=(1,0.8))
plt.xticks(x, names, rotation=45)
plt.margins(0)
plt.subplots_adjust(bottom=0.15)

#限定纵轴的范围
# JSD
#plt.ylim(0.002, 0.012)
#plt.xlabel("coupleing value w") #X轴标签题目
#plt.ylabel("JSD") #Y轴标签题目
#plt.title("Similarity test for JSD") #图标题

# JSDa
#plt.ylim(0.3, 0.8)
#plt.xlabel("coupleing value w") #X轴标签题目
#plt.ylabel("Fractional JSD") #Y轴标签题目
#plt.title("Similarity test for Fractional JSD") #图标题

# PE JSD
#plt.ylim(0, 1)
#plt.xlabel("coupleing value w") #X轴标签题目
#plt.ylabel("PE JSD") #Y轴标签题目
#plt.title("Similarity test for PE JSD") #图标题

# PE JSDa
plt.ylim(0.75, 1)
plt.xlabel("coupleing value w") #X轴标签题目
plt.ylabel("Fractional PE JSD") #Y轴标签题目
plt.title("Similarity test for Fractional PE JSD") #图标题

#pl.xlim(-1, 11)  # 限定横轴的范围


plt.tight_layout()
plt.show()

'''
,w=0.5,w=0.6,w=0.7,w=0.8,w=0.9,w=1.0
d=-0.5,0.008010576,0.004968287,0.004303913,0.006041267,0.006150513,0.008580232
d=-0.3,0.005183132,0.00611537,0.006500338,0.00526916,0.00549552,0.006976469
d=-0.1,0.005412676,0.00449054,0.004649172,0.005069015,0.004178211,0.005510701
d=0.1,0.004587355,0.005748208,0.006297116,0.006792972,0.006900773,0.006599003
d=0.3,0.0081192,0.008376743,0.008382899,0.009181676,0.010038209,0.009179388
d=0.5,0.008010576,0.00670865,0.006507468,0.007297756,0.008502907,0.008733585
'''